{{-- @props(['posts']) --}}
 <x-post-featured-card :post="$posts[0]"/>
 {{-- თუ ერთზე მეტი პოსტია ბაზაში მხოლოდ მაშინ შემოიტანოს ეს დივი  რადგან ქვევით ერორი არ ამოაგდოს--}}
 @if ($posts->count() > 1)
 
     <div class="lg:grid lg:grid-cols-6">
          {{-- ჩვეულებრივი ლუპია პოსტებზე უბრალოდ ტოვებს პირველ პოსტს ბაზიდან რადგან ეგ ზემოთ გვაქვს უკვე --}}
          @foreach ($posts->skip(1) as $postZ)
              <x-post-card 
              :post="$postZ"
              {{-- კლასში ვატანთ პირობას და ვეუბნებით რო თუ ლუპის გამეორება ნაკლებია სამზე ანუ სანამ მეოთხე პოსტი ჩაიტვირთება ერთმანეთის გვერდით დაალაგოს 2 პოსტი 4ის შემდეგ სამ სამი პოსტი --}}
               class="{{$loop->iteration < 3 ? 'col-span-3' : 'col-span-2'}}"/>
          @endforeach

     </div>
 @endif
     
  
